---
layout: post
title: "从共享单车看设计"
date: 2017-05-20
category: 自省
keywords: 共享单车，设计，摩拜，酷骑，ofo, oxo
---
上周一直计划写一个共享单车的文章，对比现今流行的几大单车设计，一直拖着也没写。又是一个月末周六，也恰好天气不错，心情也空，准备今天下手说一下。

有这个念头是因为上周跟任博几个出去办事的时候，在路边等人，正好看到路边放着好几辆摩拜，还有零散的两三个OXO 。而店面的伙计闲暇时也不是过来溜达溜达摩拜，对于马上到这个老陕的单车却未曾光顾一下。任博就此对共享单车一番点评，让我激发了这篇文章的念头。

小黄车应该是西安的第一批共享单车，刚出现的时候令人耳目一新。但是，漂亮的外表并没有掩盖掉它的问题。
* 机械锁的问题，操作起来不方便，还依赖用户来锁车。
* 单车的密码固定不变，一个很大的漏洞就是用户可以记住这个密码，下次直接使用。
* 二维码直接暴露在外，很容易划伤，被破坏。
* 轮胎是打气的，跟普通的自行车完全没区别。好吧，可以拿来直接补补我的自行车了，哪里坏了，找个小黄车，换它的零件就可以了。
* 几乎没有定位功能，我几乎是满大街跑得找，后来放弃了，采取瞎猫抓老鼠的游戏，哪里碰到了哪里再用。

前三个缺点最终导致的问题是，用户首先破坏二维码，拿个钥匙啥的，很容易就搞定。然后呢，用户深深地记住了这个车的开车密码，开始循环使用。好一点的用户还是有共享精神的，不打乱锁密码，就放在哪里，谁想用，直接开锁骑走。更有甚者，直接把车刚回了家里，用的时候开开锁骑走，不用的时候关锁当好，不花钱，还是私有资产。

为什么小黄车会这样设计呢？我认为主要有这么几点，
* 打气的车舒适度好，实心胎的要差一点
* 机械锁的成本要低些，电子锁成本高
* 电子锁还要考虑蓄电和定位的问题
* 二维码和密码的问题不太明白，想想是不是因为西安古城的人民素质杠杠的？

上面导致的一系列问题就是小黄车的破坏度很高，维护成本相当高，人力成本大。之前，看到说公司的员工加班相当严重。再看看大街上的小黄车，被尸解的，遍地都是。

接下来，我能看到的就是膜拜和酷骑了，最后才是OXO马上到。

马上到就没啥说的了，感觉就是把小黄车的作品拿过来抄了一遍，然后拿把刷子把黄色刷成了红色;当然，车架还偷工减料了，安全问题大，骑着也不舒服。

酷骑呢，还要好些，骑着也舒服点，车头大些。不过也有小黄车的通病，更有意思要提的是，它的车座真心难坐，不明白为什么咋弄成两个屁股蛋凸起的。我骑车一会就顶的我屁股难受，沙发椅子的人体学也全是凹下符合屁股体学的，而酷骑反其道而行之！怪哉，怪哉。

